УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/смартЗаявкаНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартЗаявкаНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <basedOn>Document.смартЗаявкаНаРемонтныеРаботы</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <registerRecords>AccumulationRegister.смартОборудованиеКРазборке</registerRecords>
  <registerRecords>AccumulationRegister.смартЗаявкиНаРазборкуОборудования</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.смартЗаявкаНаРемонтныеРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереместитьСоСклада</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаРазбора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Командировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоЧасов2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.смартСтатусыСогласованияЗаявокНаРазборкуОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КВыполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРазборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Узел</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелПереместитьНаСклад</name>
    <comment>#1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСнятаяЗапаснаяЧасть</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПолученныйУзел</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНаЗаменуСнятойЗапаснойЧасти</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаНеТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектующие</name>
    <comment>#1901 смарт: Ермаков 21.08.2024 / Создание документа Заявка на разборку оборудования</comment>
    <attributes>
      <name>АртикулСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереместитьНаСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаказывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяИнженера2</name>
    <attributes>
      <name>ДатаИВремяНачалаРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОкончанияРабот</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартЗаявкиНаРазборкуОборудования/смартЗаявкиНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартЗаявкиНаРазборкуОборудования</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/смартОборудованиеКРазборке/смартОборудованиеКРазборке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартОборудованиеКРазборке</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КРазборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПеремещениюЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КЗаказуПоставщикуЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборкеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучениюОборудованиеЗаказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСтатусыСогласованияЗаявокНаРазборкуОборудования/смартСтатусыСогласованияЗаявокНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыСогласованияЗаявокНаРазборкуОборудования</name>
  <comment>//++ #1901 смарт: Мосолов 11.07.2024 //Создание документа Заявка на разборку оборудования</comment>
  <enumValues>
    <name>НеУстановлен</name>
  </enumValues>
  <enumValues>
    <name>КСогласованию</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартТипыНазначенийРазобранногоОборудования/смартТипыНазначенийРазобранногоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыНазначенийРазобранногоОборудования</name>
  <comment>#Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.</comment>
  <enumValues>
    <name>СнятаяЗапаснаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПолученныйУзел</name>
  </enumValues>
  <enumValues>
    <name>НаЗаменуСнятойЗапаснойЧасти</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартЗаявкаНаРазборкуОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Представительство;
		
		Если ДокументОснование.Оборудование.Количество() Тогда
			Номенклатура = ДокументОснование.Оборудование[0].Оборудование; 
		КонецЕсли;
		
	КонецЕсли;
	
	//++ #1989 смарт: Лопато 15.08.2024 //Сделать ввод на основании Задач, Заказов на перемещение, Заказов на Сборку/Разборку для документов СЦ  
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;	
	//-- #1989 смарт: Лопато 15.08.2024
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Ссылка.СтатусСогласования = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования.Согласована
			И ЭтотОбъект.КВыполнению 
		Тогда
		
		ПроверяемыеРеквизиты.Добавить("Инженер");
		ПроверяемыеРеквизиты.Добавить("НачалоРабот");
		ПроверяемыеРеквизиты.Добавить("ОкончаниеРабот");
		
		ПроверяемыеРеквизиты.Добавить("Комплектующие");
		
		ПроверяемыеРеквизиты.Добавить("Комплектующие.Номенклатура");
		ПроверяемыеРеквизиты.Добавить("Комплектующие.ДоляСтоимости");
		ПроверяемыеРеквизиты.Добавить("Комплектующие.Количество");
		ПроверяемыеРеквизиты.Добавить("Комплектующие.ПереместитьНаСклад");
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если Склад.Пустая() Тогда
		Склад = Справочники.Склады.НайтиПоНаименованию("Ремонтная зона", Истина);  // Временно		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи); 
	
	Если СтатусСогласования = 
			Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования.НеСогласована Тогда
		
		Отменена = Истина;
		
	КонецЕсли;
	
	//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
	Если Ссылка.СтатусСогласования = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования.Согласована
			И ЭтотОбъект.КВыполнению 
		Тогда
		
		РеквизитыПроверки = "Номенклатура,Серия,Узел";
		
		ШаблонНазначения = Документы.смартЗаявкаНаРазборкуОборудования.ШаблонНазначения(ЭтотОбъект, Перечисления.смартТипыНазначенийРазобранногоОборудования.СнятаяЗапаснаяЧасть);
		Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(НазначениеСнятаяЗапаснаяЧасть, ШаблонНазначения, ЭтотОбъект, РеквизитыПроверки, Отказ);
		
		ШаблонНазначения = Документы.смартЗаявкаНаРазборкуОборудования.ШаблонНазначения(ЭтотОбъект, Перечисления.смартТипыНазначенийРазобранногоОборудования.ПолученныйУзел);
		Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(НазначениеПолученныйУзел, ШаблонНазначения, ЭтотОбъект, РеквизитыПроверки, Отказ);
		
		ШаблонНазначения = Документы.смартЗаявкаНаРазборкуОборудования.ШаблонНазначения(ЭтотОбъект, Перечисления.смартТипыНазначенийРазобранногоОборудования.НаЗаменуСнятойЗапаснойЧасти);
		Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(НазначениеНаЗаменуСнятойЗапаснойЧасти, ШаблонНазначения, ЭтотОбъект, РеквизитыПроверки, Отказ);
												
	КонецЕсли;
	//-- #Б2340 смарт: Шляпников 17.02.2025
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.смартЗаявкаНаРазборкуОборудования.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	смартСборкаРазборкаОборудованияСервер.ОтразитьЗаявкиНаРазборкуОборудования(ДополнительныеСвойства, Движения, Отказ);
	смартСборкаРазборкаОборудованияСервер.ОтразитьОборудованиеКРазборке(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ,, Ссылка);
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	смартПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	РегистрыСведений.смартСостоянияЗаявокНаРазборкуОборудования.ОтразитьСостояниеЗаявки(Ссылка, Отказ, Истина, Ссылка);
	
КонецПроцедуры  

Процедура ПриКопировании(ОбъектКопирования)
	
	КВыполнению = Ложь;
	Отменена = Ложь;
	Узел = Справочники.Номенклатура.ПустаяСсылка();
	УзелПереместитьНаСклад = Справочники.Склады.ПустаяСсылка();
	ДокументОснование = Неопределено; 
	Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	ПереместитьСоСклада = Справочники.Склады.ПустаяСсылка();
	ПричинаРазборки = "";
	ЖелаемаяДатаРазбора = Дата(1, 1, 1);
	СтатусСогласования = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования.НеУстановлен;
	ПричинаНесогласования = "";
	
	СтатусСогласования = 
		Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования.НеУстановлен;
		
	//++ #Б2138 смарт: Шляпников 19.02.2025 / Заявка на разборку оборудования. Обратная сборка оборудования.
	НазначениеСнятаяЗапаснаяЧасть = Неопределено;
	НазначениеПолученныйУзел = Неопределено;
	НазначениеНаЗаменуСнятойЗапаснойЧасти = Неопределено;
	СборкаНеТребуется = Ложь;
	//-- #Б2138 смарт: Шляпников 19.02.2025

	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
	Если Ссылка.СтатусСогласования = Перечисления.смартСтатусыСогласованияЗаявокНаРазборкуОборудования.Согласована
			И ЭтотОбъект.КВыполнению 
		Тогда
		
		ШаблонНазначения = Документы.смартЗаявкаНаРазборкуОборудования.ШаблонНазначения(ЭтотОбъект, Перечисления.смартТипыНазначенийРазобранногоОборудования.СнятаяЗапаснаяЧасть);
		Справочники.Назначения.ПриЗаписиДокумента(НазначениеСнятаяЗапаснаяЧасть,
												  ШаблонНазначения,
												  ЭтотОбъект,
												  Неопределено,
												  Неопределено);
												  
		ШаблонНазначения = Документы.смартЗаявкаНаРазборкуОборудования.ШаблонНазначения(ЭтотОбъект, Перечисления.смартТипыНазначенийРазобранногоОборудования.ПолученныйУзел);
		Справочники.Назначения.ПриЗаписиДокумента(НазначениеПолученныйУзел,
												  ШаблонНазначения,
												  ЭтотОбъект,
												  Неопределено,
												  Неопределено);
												  
		ШаблонНазначения = Документы.смартЗаявкаНаРазборкуОборудования.ШаблонНазначения(ЭтотОбъект, Перечисления.смартТипыНазначенийРазобранногоОборудования.НаЗаменуСнятойЗапаснойЧасти);
		Справочники.Назначения.ПриЗаписиДокумента(НазначениеНаЗаменуСнятойЗапаснойЧасти,
												  ШаблонНазначения,
												  ЭтотОбъект,
												  Неопределено,
												  Неопределено);
												  
	КонецЕсли;
	//-- #Б2340 смарт: Шляпников 17.02.2025
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	Массив.Добавить(Движения.смартЗаявкиНаРазборкуОборудования);
	Массив.Добавить(Движения.смартОборудованиеКРазборке);
		
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
